# IntroducciÃ³n a Pandas

[Pandas org](https://pandas.pydata.org) es una biblioteca que proporciona estructuras de datosy herramientas de analisis de datos de alto rendimiento y faciles de usar.

* la estructura de datos principal es el dataFrame que puede considerarse como una tabla 2D en memoria (como una hoja de calculo, con nombres de columna y etiquetas de fila).
* Muchas funciones Disponibles en Exel estan disponibles mediante programacion, como crear tablas dinamicas, calcular columnas basadas en otras columnas, trazar graficos.

### Crear un Objeto DataFraem

In [2]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in /home/carpio/.local/lib/python3.13/site-packages (2.3.1)
Requirement already satisfied: numpy>=1.26.0 in /home/carpio/.local/lib/python3.13/site-packages (from pandas) (2.3.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/lib/python3.13/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /home/carpio/.local/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /home/carpio/.local/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /usr/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [18]:
import pandas as pd

In [19]:
personas = {
    "peso": pd.Series([234, 23, 56, 895], ["mario", "tenjai", "Juan", "Xarolos"]),
    "Altura": pd.Series({"mario": 213, "tenjai": 234, "Juan":34, "Xarolos": 45}),
    "Hijos": pd.Series([1,0], ["mario", "tenjai"])
}

In [20]:

df = pd.DataFrame(personas)

df

         peso  Altura  Hijos
Juan       56      34    NaN
Xarolos   895      45    NaN
mario     234     213    1.0
tenjai     23     234    0.0

In [21]:
# Crear un DataFrame e inicializarlo con una lista de listas
# NOTA: Deben de speecificarse las columnas e indices por separado

valores=[
                  [185, 1, 78],
                  [160, 1, 67],
                  [154, 0, 56]
                  ]
df = pd.DataFrame(
    valores,
    columns=["Altura", "Hijos", "Peso"],
    index=["dksa", "sadksa","lksadjlsad"]
)

### Acceso a los elementos de un dataframe

In [22]:
personas = {
    "Altura": {"dksa": 185, "sadksa":160, "lksadjlsad":154},
    "Peso": {"dksa": 78, "sadksa":67, "lksadjlsad":56},
    "Hijos": pd.Series([0,40,3],["dksa", "sadksa","lksadjlsad"])
}
df = pd.DataFrame(personas)
df

            Altura  Peso  Hijos
dksa           185    78      0
sadksa         160    67     40
lksadjlsad     154    56      3

### Acceso a las columnas de datos del DtaFrame

In [24]:
df[["Peso", "Altura"]]

            Peso  Altura
dksa          78     185
sadksa        67     160
lksadjlsad    56     154

In [26]:
# Pueden combinarse os metodos anterores con metrodo booleano

df["Peso"]>60

dksa           True
sadksa         True
lksadjlsad    False
Name: Peso, dtype: bool

In [27]:
df[df["Peso"]>60]

        Altura  Peso  Hijos
dksa       185    78      0
sadksa     160    67     40

#### Acceso a los elementos de la fila del DataFrame

In [28]:
# Mostrar el DF 
df

            Altura  Peso  Hijos
dksa           185    78      0
sadksa         160    67     40
lksadjlsad     154    56      3

In [29]:
df.loc["dksa"]

df.iloc[1:3]

            Altura  Peso  Hijos
sadksa         160    67     40
lksadjlsad     154    56      3

### Consulta avanzada de los elementos de un DF

In [30]:
df.query("Altura >= 170 and Peso >70")

      Altura  Peso  Hijos
dksa     185    78      0

### Copear el DF

In [31]:
# Copear el DF dn df_copy 
# Nota: Al importar un elemento de df_copy no se modifica el df
df_copy = df.copy()

In [32]:
df_copy

            Altura  Peso  Hijos
dksa           185    78      0
sadksa         160    67     40
lksadjlsad     154    56      3

#### Modificacion de un DF

In [38]:
# CreaciÃ³n de un df e inicializarlo con un diccionario de objetos Series
personas = {
    "Peso": pd.Series([78,67,56], ["dksa", "sadksa", "lksadjlsad"]),
    "Altura": pd.Series({"dksa":185, "sadksa": 160, "lksadjlsad": 154}),
    "Hijos": pd.Series([0, 40, 0], ["dksa", "sadksa", "lksadjlsad"])
}
df = pd.DataFrame(personas)
df

            Peso  Altura  Hijos
dksa          78     185      0
sadksa        67     160     40
lksadjlsad    56     154      0

In [43]:
# AÃ±adir nueva columna al DF
df["AÃ±o"] = [2005, 2005, 2008]
df

            Peso  Altura  Hijos   AÃ±o  Edad
dksa          78     185      0  2005    20
sadksa        67     160     40  2005    20
lksadjlsad    56     154      0  2008    17

In [44]:
# AÃ±adiir nueva columna calculada al df
df["Edad"] = 2025 - df["AÃ±o"]
df

            Peso  Altura  Hijos   AÃ±o  Edad
dksa          78     185      0  2005    20
sadksa        67     160     40  2005    20
lksadjlsad    56     154      0  2008    17

In [46]:
# AÃ±adir una nueva columna creando en DF Nuevo
df_mod = df.assign(mascotas = [1,2,1])
df_mod

            Peso  Altura  Hijos   AÃ±o  Edad  mascotas
dksa          78     185      0  2005    20         1
sadksa        67     160     40  2005    20         2
lksadjlsad    56     154      0  2008    17         1

In [47]:
# Eliminar una columna existente de l DF
del df_mod["AÃ±o"]

In [48]:
df_mod

            Peso  Altura  Hijos  Edad  mascotas
dksa          78     185      0    20         1
sadksa        67     160     40    20         2
lksadjlsad    56     154      0    17         1

In [49]:
# Eliminar una columna existente de una copia del DF resultante
df_mod = df.drop(["Hijos"], axis=1)
df_mod

            Peso  Altura   AÃ±o  Edad
dksa          78     185  2005    20
sadksa        67     160  2005    20
lksadjlsad    56     154  2008    17

#### Evalucion de expresiones sobre DF

In [52]:
# Evaluar una funcion sobre una columna del DF
df.eval("Media_Altura = Altura / 2", inplace=True)
df

            Peso  Altura  Hijos   AÃ±o  Edad  Media_Altura
dksa          78     185      0  2005    20          92.5
sadksa        67     160     40  2005    20          80.0
lksadjlsad    56     154      0  2008    17          77.0

In [53]:
# Evaluar una FunciÃ³n utilizando una variable local
max_altura = 180
df.eval("Altura > @max_altura")

dksa           True
sadksa        False
lksadjlsad    False
Name: Altura, dtype: bool

In [54]:
# Aplixar una funcion externa a una columna del DF
def func(x):
    return x + 2
df["Peso"].apply(func)

dksa          80
sadksa        69
lksadjlsad    58
Name: Peso, dtype: int64

In [55]:
df_mod

            Peso  Altura   AÃ±o  Edad
dksa          78     185  2005    20
sadksa        67     160  2005    20
lksadjlsad    56     154  2008    17

#### Guardar y cargar el DF